In [6]:
import pandas as pd
from pandasql import sqldf

In [2]:
id_attr = [1,2,3,4]
name_attr = ['Joe', 'Henry', 'Sam', 'Max']
salary = [70000, 80000, 60000, 90000]
manager_id = [3,4, 'NULL', 'NULL']

dict1 = {'ID' : id_attr, 'ame': name_attr, 'salary': salary, 'manager_id':manager_id}

In [3]:
df2 = pd.DataFrame(dict1)

df2

   ID    ame  salary manager_id
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       NULL
3   4    Max   90000       NULL

In [12]:
id_attr = [1,2,3]
email = ['john@example.com', 'bob@example.com', 'john@example.com']
dict3 = { 'ID' : id_attr, 'email' : email}

df3 = pd.DataFrame(dict3)
df3.head()

   ID             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [13]:
q = 'select id, email from df3 group by email having count(email) >= 1'
sqldf(q, globals())

   ID             email
0   2   bob@example.com
1   1  john@example.com